# Напишіть гру "Камінь ножиці папір". Схема роботи така:
# користувачу виводиться повідомлення зі списком фігур.
# користувач обриає якусь фігуру, програма випадковим чином обирає свою.
# визначається переможець
# Опціонально можна додати можливість запропонувати продовжувати гру (Y\N) і вести рахунок перемог.
# P.s винесіть всі функції в окремий файл і імпортуцте їх звідти для роботи
from hw8.function import *

start = "y"

while start in ["y", "Y"]:
    user = user_select_figure()
    comp = comp_select_figure()
    winner = define_winner(user, comp)
    show_result(winner)
    start = ask_continue()
