# "Касир в кінотеатрі"
#Попросіть користувача ввести свсвій вік (можно використати константу або функцію input()).
#- якщо користувачу менше 7 - вивести "Де твої батьки?"
#- якщо користувачу менше 16 - вивести "Це фільм для дорослих!"
#- якщо користувачу більше 65 - вивести "Покажіть пенсійне посвідчення!"
#- якщо вік користувача складається з однакових цифр
#(11, 22, 44 і тд років, всі можливі варіанти!) - вивести "Який цікавий вік!"
#- у будь-якому іншому випадку - вивести "А білетів вже немає!"

age = int(input("Please, enter your age:  "))

if age % 11 == 0:
    print("What an interesting age!")
elif age <= 7:
    print("Where are your parents?")
elif age <= 16:
    print("This is a movie for adults!")
elif age >= 65:
    print("Show your pension certificate!")
else:
    print("And there are no more tickets!")
