# #Знову апишіть программу "Касир в кінотеатрі", яка буде виконувати наступне:
#
# Попросіть користувача ввести свсвій вік.
# - якщо користувачу менше 7 - вивести "Тобі ж <>! Де твої батьки?"
# - якщо користувачу менше 16 - вивести "Тобі лише <>, а це е фільм для дорослих!"
# - якщо користувачу більше 65 - вивести "Вам <>? Покажіть пенсійне посвідчення!"
# - якщо вік користувача складається з однакових цифр (11, 22, 44 і тд років, всі можливі варіанти!)
# - вивести "О, вам <>! Який цікавий вік!"
# - у будь-якому іншому випадку - вивести "Незважаючи на те, що вам <>, білетів всеодно нема!"

# Замість <> в кожну відповідь підставте значення віку (цифру) та правильну форму слова рік
# Для будь-якої відповіді форма слова "рік" має відповідати значенню віку користувача.
# Наприклад: "Тобі ж 5 років! Де твої батьки?"
# "Вам 81 рік? Покажіть пенсійне посвідчення!"
# "О, вам 33 роки! Який цікавий вік!"
#
# Зробіть все за допомогою функцій! Для кожної функції пропишіть докстрінг.
#
# Не забувайте що кожна функція має виконувати тільки одне завдання, і про правила написання коду.


age = int(input("Вкажіть, будь ласка, свій вік:  "))


def get_year(age_):
    """Get ukrainian word year in write declination"""
    last_digit = int(str(age_)[-1])
    if age_ in range(5, 21) or last_digit in [5, 6, 7, 8, 9, 0]:
        return "років"
    elif last_digit == 1:
        return "рік"
    else:
        return "роки"


def get_cashier_answer(age_):
    """Build cashier's answer for required age"""
    year = get_year(age_)
    if age % 11 == 0:
        return f"О, вам {age_} {year}! Який цікавий вік!"
    elif age < 7:
        return f"Тобі ж {age_} {year}! Де твої батьки?"
    elif age < 16:
        return f"Тобі лише {age_} {year}, а це є фільм для дорослих!"
    elif age > 65:
        return f"Вам {age_} {year}? Покажіть пенсійне посвідчення!"
    else:
        return f"Незважаючи на те, що вам {age_} {year}, білетів всеодно нема!"


print(get_cashier_answer(age))
